using System.Collections;
using System.Collections.Generic;
using UnityEngine;

[System.Serializable]
public class Move : MonoBehaviour{
#region 變數宣告 ===============================================================================================================

    #endregion =============================================================================================================== 變數宣告
    
    #region 函式 ===============================================================================================================
    /// <summary>
    /// 初始化函式
    /// </summary>
    public void Move_Initialize() {
        
    }

    /// <summary>
    /// 移動主架構
    /// </summary>
    virtual public void _Move() {

    }

    #endregion =============================================================================================================== 函式
}
